
class Condition {
	void task1() {
		System.out.println("1. В массиве чисел найти сумму элемнтов"
				+ " кратных числу K.");
	}
	
	void task2() {
		System.out.println("2. Дана последовательность чисел. Заменить"
				+ " все числа, большие Z, этим числом. Посчитать кол-во замен.");
	}
	
	void task3() {
		System.out.println("3. Почситать, сколько в массиве размерностью N"
				+ " отрицательных, положительных и нулевых элементов.");
	}
	
	void task4() {
		System.out.println("4. Дана последовательность чисел. Поменять местами "
				+ "наибольшее и наименьшее.");
	}
	
	void task5() {
		System.out.println("5. Вывести на печать числа, которые больше i.");
	}
	
	void task6() {
		System.out.println("6. Вывести сумму чисел, индекс которых является"
				+ " простым числом.");
	}
	
	void task7() {
		System.out.println("7. Найти максимальную сумму двух соседниx чисел");
	}
	
	void task8() {
		System.out.println("8. Из последовательности чисел выбросить минимальное число");
	}
	
	void task9() {
		System.out.println("9. В массиве определить чаще встречающееся число."
				+ " Если их несколько - определить наименьшее из них");
	}
	
	void task10() {
		System.out.println("10. В массиве каждый второй элемент заменить 0."
				+ " Доп. массив не изпользовать");
	}
}
